[
  "\n\nMaximiliano Cuesta\nData Scientist & AI Specialist\ncmaxi14.87@gmail.com\nIntroducción\n•Resumen Profesional: Como Analista de Sistemas con un fuerte interés \nen el área de Datos, busco integrarme a un equipo dinámico donde pueda \naportar mi experiencia y aprender en roles de Data Science o afines. Soy \nuna persona tranquila, paciente y estructurada, con habilidades \ndestacadas en persistencia, trabajo en equipo, adaptabilidad, pensamiento \ncrítico, autonomía, escucha activa y responsabilidad.\nEn mi trabajo actual, he desarrollado y optimizado diversas aplicaciones \nutilizando Python, contribuyendo significativamente a la eficiencia operativa. \nMi enfoque es contribuir al éxito del equipo mediante soluciones efectivas, \nsiempre orientado a metas ambiciosas.\nBusco oportunidades para crecer y aplicar mis conocimientos en proyectos \ndesafiantes, donde la excelencia técnica y las habilidades blandas converjan \npara alcanzar el éxito colectivo. Estoy comprometido con la mejora continua \ny dispuesto a enfrentar nuevos retos que impulsen tanto mi desarrollo \nprofesional como el de la organización.\nExperiencia Profesional\n•Operador de Centro de Control de Energia- SCPL (10/2007 - Presente)\n•Responsabilidades:\nCoordinar, supervisar y controlar el estado del sistema eléctrico local, \ngarantizando el cumplimiento de condiciones preestablecidas. Mi experiencia \nincluye la operación de equipamientos de media y alta tensión, así como \n\nelaborar informes estadísticos para evaluar y mejorar el rendimiento del \nsistema. Estos informes son presentados a la gerencia eléctrica para\nrespaldar decisiones estratégicas. Mi compromiso con la excelencia \noperativa y habilidades analíticas han sido fundamentales para el éxito en el \nsector eléctrico.\nEducación\n•Analista de Sistemas -Universidad Siglo XXI (2021)\n•Certificaciones:\n•Cientifico de Datos -Instituto Platzi (2023)\nHabilidades\n•Lenguajes de Programación: Python\n•Tecnologías y Herramientas: Pandas, Numpy, Matplotlib, Seaborn, Scikit-\nLe",
  "arn, MySQL, PostgreSQL, Tableau\n•Habilidades Blandas: persistencia, trabajo en equipo, adaptabilidad, \npensamiento crítico, autonomía, escucha activa y responsabilidad\n•Idiomas: Ingles (Basico)\nProyectos Relevantes\n•Data Scientist - <Análisis de los 25 retailers más grandes de EEUU>\n•Descripción: El objetivo de este proyecto fue el análisis de las 25 \nempresas de retailers para importante de EEUU.\n•Rol: Analista de Datos.\n•Tecnologías Utilizadas: Python, Pandas, Numpy, Matplotlib, Seaborn\n•Enlace: https://deepnote.com/workspace/maxijcuesta-24f98f3d-\nb68b-4750-a177-2dad5d8adf8a/project/Proyecto-\nDatacademy-5593b676-2bb4-4c09-8c9b-d62f660cc966/notebook/\n115d016c8c6a4232af6b62f506d8f4c1\n\n•Data Scientist - <Calidad de Vinos>\n•Descripción: Se centra en el análisis de calidad de vino, teniendo en \ncuenta dos dataset (vino tinto y vino blanco). \n•Rol: Analista de Datos.\n•Tecnologías Utilizadas: Python, Pandas, Numpy, Matplotlib, Seaborn\n•Enlace: https://deepnote.com/workspace/maxijcuesta-24f98f3d-\nb68b-4750-a177-2dad5d8adf8a/project/Proyecto-Analisis-Exploratorio-\nde-Datos-Duplicate-3f587fc9-a9c2-4dec-8454-6519f45b7588/notebook/\n20d4dacbc4e14ac7819213fe8abf055b\n•Data Scientist - <Adult- Census >\n•Descripción: Se realizó el análisis exploratorio de datos y se construyó \nmodelos de Random Forest para predecir si una persona gana más de \n50k dólares al año.\n•Rol: Data Scientist.\n•Tecnologías Utilizadas: Python, Pandas, Numpy, Matplotlib, \nSeaborn,Sklearn\n•Enlace: https://github.com/maxijcuesta/Adult-Census\nPreguntas Frecuentes (FAQs)\n•\n¿Qué experiencia tienes en Data Science?\n•Desde el año 2021que comencé con la carrera de Data Scientist que \ncomencé en análisis de datos, desarrollo de modelos predictivos y \noptimización de algoritmos.\n•\n¿Cuál es tu experiencia en la limpieza y preparación de datos?\n•He trabajado extensamente en la limpieza y preparación de datos, \nincluyendo la identificación y corrección de datos faltantes o erróneos, \nla normalización de datos y la transfo",
  "rmación de datos para su uso en \nmodelos de aprendizaje automático.\n•\n¿Cómo te mantienes actualizado con las últimas tendencias y \ntecnologías en ciencia de datos?\n\n•Me mantengo actualizado participando en cursos y certificaciones en \nplataformas como Platzi y Microsoft Learn. Además, sigo blogs, \npodcasts, y asisto a conferencias y webinars sobre ciencia de datos y \nmachine learning. Puedes ver algunos de mis cursos y certificaciones \naquí:\n•Platzi: https://platzi.com/p/maxijcuesta/\n•Microsoft Learn: https://learn.microsoft.com/es-mx/users/\nmaxijcuesta\n•\n¿Cuál es tu motivación y objetivo profesional a largo plazo?\n•A lo largo de mis 37 años, he acumulado 17 años de experiencia en la \nmisma empresa, lo que me ha proporcionado una base sólida en la \nindustria. Hace cinco años, decidí ampliar mis horizontes y comencé a \nestudiar para mejorar mis oportunidades laborales. Mi objetivo es \nreconfigurar mi vida profesional para trabajar desde casa, permitiéndome \nun equilibrio entre la vida laboral y personal. Me apasiona generar \nsoluciones informáticas utilizando datos y la inteligencia artificial. Disfruto \nprogramar, analizar datos, entrenar modelos y visualizarlos para \nproporcionar información valiosa y soluciones prácticas. Estoy \ncomprometido a seguir creciendo en este campo y a contribuir con \nsoluciones innovadoras que impulsen el éxito de las organizaciones.\n•\n  ¿Qué herramientas utilizas para la visualización de datos?\n•Utilizo herramientas como Tableau, Matplotlib y Seaborn para crear \nvisualizaciones interactivas y comprensibles que ayudan a comunicar \ninsights y resultados de análisis de datos de manera efectiva.\n•\n ¿Puedes describir un proyecto donde aplicaste técnicas de machine \nlearning?\n•En un proyecto reciente, desarrollé un modelo de Random Forest para \npredecir si una persona gana más de 50k dólares al año utilizando el \ndataset de Adult Census. Este proyecto incluyó la limpieza de datos, \nla ingeniería de características y la evaluación del modelo.\n",
  "•\n ¿Cómo aseguras la calidad de los datos en tus proyectos?\n\n•Implemento procesos rigurosos de limpieza de datos, incluyendo la \ndetección y corrección de valores atípicos, la imputación de datos \nfaltantes y la validación cruzada. Además, utilizo herramientas de \ngestión de datos y técnicas de ETL para asegurar que los datos sean \nprecisos y consistentes.\n•\n ¿Qué tipo de problemas te gusta resolver con ciencia de datos?\n•Me apasiona resolver problemas que implican grandes volúmenes de datos \ny que requieren análisis complejos para extraer insights valiosos. Esto \nincluye la predicción de comportamientos del cliente, la detección de \nfraudes y la optimización de procesos empresariales.\n•\n ¿Cómo manejas la privacidad y la ética en tus proyectos de datos?\n•Soy muy consciente de la importancia de la privacidad y la ética en el \nmanejo de datos. Siempre sigo las mejores prácticas y regulaciones \ncomo GDPR, y aseguro que los datos sensibles estén protegidos \nmediante técnicas de anonimización y cifrado cuando sea necesario.\n•\n¿Estás trabajando en algún proyecto de creación de chatbots?\n•Sí, actualmente estoy incursionando en la creación de chatbots utilizando \nChatGPT de OpenAI. Estoy desarrollando un chatbot personalizado \nque puede integrarse en páginas web para proporcionar respuestas \nautomatizadas y asistencia interactiva a los usuarios. Este proyecto \nme ha permitido aplicar mis conocimientos en programación y análisis \nde datos para crear soluciones innovadoras que mejoren la \nexperiencia del usuario y optimicen los procesos de atención al \ncliente.\nSección de Recursos y Perfiles Profesionales\nRecursos y Perfiles Profesionales\n•Platzi: https://platzi.com/p/maxijcuesta/\n•Microsoft Learn: https://learn.microsoft.com/es-mx/users/maxijcuesta\n•GitHub: https://github.com/maxijcuesta\n•LinkedIn: https://www.linkedin.com/in/maxijcuesta/\n\nContacto\n•Nombre: Maximiliano Cuesta\n•Email: cmaxi14.87@gmail.com\n•Teléfono: +54 2974392553\n•X: https://x.com/maxijcuesta"
]